# Day 1 Laboratory - Familiarise with Pandas

## Import libraries

In [2]:
import pandas as pd
import numpy as np

## Load dataset and explore it

In [31]:
df = pd.read_csv("https://ssciwr.github.io/jupyter-data-exploration/data.csv")

In [32]:
df.shape

(20, 6)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           20 non-null     object
 1   Age            20 non-null     int64
 2   Sex            20 non-null     object
 3   Height         20 non-null     float64
 4   Eye colour     20 non-null     object
 5   Wears glasses  20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB

In [30]:
df.head(5)

     Name  Age     Sex  Height Eye colour Wears glasses
0     Bob   12    Male   130.0       blue           yes
1   Simon   13    Male   120.0       blue            no
2   Clare   15  Female   142.5      green            no
3    Jose   11    Male   117.0      brown            no
4  Hannah    9  Female   111.0       blue           yes

In [34]:
df.describe(include='all')

         Name        Age   Sex      Height Eye colour Wears glasses
count      20  20.000000    20   20.000000         20            20
unique     19        NaN     2         NaN          4             2
top     Chris        NaN  Male         NaN       blue            no
freq        2        NaN    12         NaN          8            15
mean      NaN   9.350000   NaN  112.200000        NaN           NaN
std       NaN   3.869925   NaN   23.283945        NaN           NaN
min       NaN   2.000000   NaN   59.000000        NaN           NaN
25%       NaN   7.500000   NaN  104.750000        NaN           NaN
50%       NaN   9.500000   NaN  111.750000        NaN           NaN
75%       NaN  12.000000   NaN  124.000000        NaN           NaN
max       NaN  16.000000   NaN  158.000000        NaN           NaN